IDEA Open Model
ConnectionPoint Properties
The ConnectionPoint type exposes the following members.
Properties
Name | Description
BearingMember
 Bearing Member
ConnectedMembers
 Connected members as collection of IDs.
Id
 Element Id
 (Inherited from OpenElementId.)
Name
 Name of Element
Node
 Node
NodeId |  Obsolete.
 Id of node
Top
See Also
Reference
ConnectionPoint Class
IdeaRS.OpenModel.Connection Namespace